# -*- org-export-babel-evaluate: (quote inline-only);  -*-
#+TITLE: Exploring the Ranges Infrastructure

#+OPTIONS: toc:t H:2
#+PROPERTY: session *R:RangesTutorial2017*
#+PROPERTY: exports both
#+PROPERTY: results output
#+PROPERTY: eval no-export

** Sensitivity
   :PROPERTIES:
   :ID:       701C34E9-1571-46CD-9F08-7BC1CC195EFA
   :END:
   #+begin_src R
   mean(truth$called)
   #+end_src

   #+RESULTS:
   : 0.82

   
** Specificity
   :PROPERTIES:
   :ID:       CF61DB49-2656-4148-A8AA-F56258405B01
   :END:
   Determine which calls were true:
   #+begin_src R
     calls$fp <- TRUE
     calls$fp[subset(truth, called)$call] <- FALSE
   #+end_src

   Compute FDR:
   #+begin_src R
     mean(calls$fp)
   #+end_src

   #+RESULTS:
   : 0.10

   
** FDR highly associated with "alt" regions
   :PROPERTIES:
   :ID:       AED5A628-7B7B-40E2-ACFA-F738AB077BBF
   :END:
     Compute the association between FP status and overlap of an alt
     region:
     #+begin_src R
       calls$inAlt <- calls %over% altRegions
       xtabs(~ inAlt + fp, calls)
     #+end_src

     #+RESULTS:
     | inAlt | fp:FALSE | fp:TRUE |
     |-------+----------+---------|
     | FALSE |     1402 |     112 |
     | TRUE  |       58 |      52 |

